function MD5_analysis(str:String):Array {
	var resolveArray = MD5.hash(str).split("");
	var solve = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0];
	var trans = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "a", "b", "c", "d", "e", "f"];
	for (var i = 0; i<=15; i++) {
		for (var j = 0; j<=31; j++) {
			if (trans[i] == resolveArray[j]) {
				solve[j] = i;
			}
		}
	}
	return solve;
}
function getID(p/*种子1-65536*/):String{
	p %= 65536;
	var normal = ["空气","洞穴空气","虚空空气",
				  "沙砾","黑曜石","粘土块","砖块","陶瓦","泥土","砂土","灰化土","菌丝","草方块",
				  "冰","浮冰","雪",
				  "沙子","砂岩","平滑砂岩","红沙", "红砂岩","平滑红砂岩","錾制砂岩","錾制红砂岩",
				  "石头","花岗岩","磨制花岗岩","平滑石头","圆石","苔石","闪长岩","磨制闪长岩","石砖","苔石砖","裂石砖",
				  "錾制石砖","安山岩","磨制安山岩","水","岩浆","煤矿石","铁矿石",
				  "沙砾","黑曜石","粘土块","砖块","陶瓦","泥土","砂土","灰化土","菌丝","草方块",
				  "冰","浮冰","雪",
				  "沙子","砂岩","平滑砂岩","红沙", "红砂岩","平滑红砂岩","錾制砂岩","錾制红砂岩",
				  "石头","花岗岩","磨制花岗岩","平滑石头","圆石","苔石","闪长岩","磨制闪长岩","石砖","苔石砖","裂石砖",
				  "錾制石砖","安山岩","磨制安山岩","水","岩浆","煤矿石","铁矿石",
				  "沙砾","黑曜石","粘土块","砖块","陶瓦","泥土","砂土","灰化土","菌丝","草方块",
				  "冰","浮冰","雪",
				  "沙子","砂岩","平滑砂岩","红沙", "红砂岩","平滑红砂岩","錾制砂岩","錾制红砂岩",
				  "石头","花岗岩","磨制花岗岩","平滑石头","圆石","苔石","闪长岩","磨制闪长岩","石砖","苔石砖","裂石砖",
				  "錾制石砖","安山岩","磨制安山岩","水","岩浆","煤矿石","铁矿石",
				  "沙砾","黑曜石","粘土块","砖块","陶瓦","泥土","砂土","灰化土","菌丝","草方块",
				  "冰","浮冰","雪",
				  "沙子","砂岩","平滑砂岩","红沙", "红砂岩","平滑红砂岩","錾制砂岩","錾制红砂岩",
				  "石头","花岗岩","磨制花岗岩","平滑石头","圆石","苔石","闪长岩","磨制闪长岩","石砖","苔石砖","裂石砖",
				  "錾制石砖","安山岩","磨制安山岩","水","岩浆","煤矿石","铁矿石",
				  "橡木木板","丛林木板","白桦木板","云杉木板","金合欢木板","深色橡树木板",
				  "玻璃","海晶石","海晶石砖","暗海晶石","海晶灯","海绵","湿海绵",
				  "下界石英矿石","地狱岩", "灵魂沙","岩浆块","地狱砖块","红色地狱砖","地狱疣块",
				  "末地石","末地石砖","紫珀块","竖纹紫珀块",
				  "橡木原木","丛林原木","白桦原木","云杉木","金合欢木","深色橡树木",
				  "橡木","丛林木","白桦木","云杉原木","金合欢原木","深色橡木",
				  "去皮橡木","去皮丛林木","去皮白桦木","去皮云杉原木","去皮金合欢原木","去皮深色橡木",
				  "去皮橡木原木","去皮丛林原木","去皮白桦原木","去皮云杉原木","去皮金合欢原木","去皮深色橡树原木",
				  "橡树树叶","丛林树叶","白桦树叶","云杉树叶","金合欢树叶","深色橡树树叶",
				  "橡树树苗","丛林树苗","白桦树苗","云杉树苗","金合欢树苗","深色橡树树苗",
				  "西瓜","南瓜","管珊瑚块","脑纹珊瑚块","气泡珊瑚块","火珊瑚块","鹿角珊瑚块",
				  "失活的管珊瑚","失活的脑纹珊瑚","失活的气泡珊瑚","失活的火珊瑚","失活的鹿角珊瑚",
				  "管珊瑚","脑纹珊瑚","气泡珊瑚","火珊瑚","鹿角珊瑚",
				  "失活的管珊瑚块","失活的脑纹珊瑚块","失活的气泡珊瑚块","失活的火珊瑚块","失活的鹿角珊瑚块",
				  "烈焰棒","骨头","粘土","煤炭","木炭","末影珍珠","青金石",
				  "羽毛","燧石","恶魂之泪","玻璃瓶","萤石粉","金锭","金粒","铁锭","铁粒","火药",
				  "海洋之心","皮革","岩浆膏","鹦鹉螺壳","下界石英","地狱疣","纸","幻翼膜","海晶砂粒",
				  "海晶碎片","兔子皮","兔子腿","红石粉","鳞甲","潜影壳","粘液球","木棍","糖","线",
				  "烈焰粉","书","碗","红砖","地狱砖","末影之眼","发酵蛛眼","烟火之星","爆裂紫颂果",
				  "苹果","甜菜根","胡萝卜","面包","蘑菇煲","甜菜汤","迷之炖菜","兔肉煲","紫颂果","马铃薯","烤马铃薯",
				  "曲奇","干海带","南瓜派","西瓜片","牛奶","蜘蛛眼","腐肉","骨粉","墨囊","鸡蛋",
				  "生牛肉","生鸡肉","生猪排","生羊肉","生兔肉","生鲑鱼","生鳕鱼",
				  "牛排","熟鸡肉","熟猪排","熟羊肉","熟兔肉", "熟鲑鱼","熟鳕鱼",
				  "小麦种子","西瓜种子","南瓜种子","甜菜种子","小麦","可可豆","甜浆果",
				  "桶","水桶","岩浆桶","鳕鱼桶","热带鱼桶","河豚桶","鲑鱼桶",
				  "经验球","羊驼唾沫","唤魔者尖刺","潜影贝导弹","凋灵之首","末影龙火球",
				  "烈焰棒","骨头","粘土","煤炭","木炭","末影珍珠","青金石",
				  "羽毛","燧石","恶魂之泪","玻璃瓶","萤石粉","金锭","金粒","铁锭","铁粒","火药",
				  "海洋之心","皮革","岩浆膏","鹦鹉螺壳","下界石英","地狱疣","纸","幻翼膜","海晶砂粒",
				  "海晶碎片","兔子皮","兔子腿","红石粉","鳞甲","潜影壳","粘液球","木棍","糖","线",
				  "烈焰粉","书","碗","红砖","地狱砖","末影之眼","发酵蛛眼","烟火之星","爆裂紫颂果",
				  "苹果","甜菜根","胡萝卜","面包","蘑菇煲","甜菜汤","迷之炖菜","兔肉煲","紫颂果","马铃薯","烤马铃薯",
				  "曲奇","干海带","南瓜派","西瓜片","牛奶","蜘蛛眼","腐肉","骨粉","墨囊","鸡蛋",
				  "生牛肉","生鸡肉","生猪排","生羊肉","生兔肉","生鲑鱼","生鳕鱼",
				  "牛排","熟鸡肉","熟猪排","熟羊肉","熟兔肉", "熟鲑鱼","熟鳕鱼",
				  "小麦种子","西瓜种子","南瓜种子","甜菜种子","小麦","可可豆","甜浆果",
				  "桶","水桶","岩浆桶","鳕鱼桶","热带鱼桶","河豚桶","鲑鱼桶",
				  "经验球","羊驼唾沫","唤魔者尖刺","潜影贝导弹","凋灵之首","末影龙火球",
				  "蝙蝠","鸡","鳕鱼","鲑鱼","牛","哞菇","猪","兔子","羊","鱿鱼","热带鱼","狼",
				  "猫","狐狸","熊猫","鹦鹉",
				  "海龟","海豚","村民","河豚","蜘蛛","北极熊","僵尸猪人","末影人",
				  "僵尸","僵尸村民","溺尸","守卫者","骷髅","爬行者","尸壳","流浪者",
				  "史莱姆","恼鬼","女巫","卫道士","凋零骷髅","岩浆怪","夜魅","唤魔者",
				  "掠夺者","恶魂","蠹虫","末影螨","烈焰人","潜影贝","洞穴蜘蛛",
				  "蝙蝠","鸡","鳕鱼","鲑鱼","牛","哞菇","猪","兔子","羊","鱿鱼","热带鱼","狼",
				  "猫","狐狸","熊猫","鹦鹉",
				  "海龟","海豚","村民","河豚","蜘蛛","北极熊","僵尸猪人","末影人",
				  "僵尸","僵尸村民","溺尸","守卫者","骷髅","爬行者","尸壳","流浪者",
				  "史莱姆","恼鬼","女巫","卫道士","凋零骷髅","岩浆怪","夜魅","唤魔者",
				  "掠夺者","恶魂","蠹虫","末影螨","烈焰人","潜影贝","洞穴蜘蛛",
				  "蝙蝠","鸡","鳕鱼","鲑鱼","牛","哞菇","猪","兔子","羊","鱿鱼","热带鱼","狼",
				  "猫","狐狸","熊猫","鹦鹉",
				  "海龟","海豚","村民","河豚","蜘蛛","北极熊","僵尸猪人","末影人",
				  "僵尸","僵尸村民","溺尸","守卫者","骷髅","爬行者","尸壳","流浪者",
				  "史莱姆","恼鬼","女巫","卫道士","凋零骷髅","岩浆怪","夜魅","唤魔者",
				  "掠夺者","恶魂","蠹虫","末影螨","烈焰人","潜影贝","洞穴蜘蛛"
				  ];
	var rare = ["气泡柱","白色陶瓦","品红色陶瓦","橙色陶瓦","红色陶瓦","黄色陶瓦","绿色陶瓦","淡蓝色陶瓦","紫色陶瓦",
				"黄绿色陶瓦","粉红色陶瓦","灰色陶瓦","黑色陶瓦","淡灰色陶瓦","棕色陶瓦","蓝色陶瓦","青色陶瓦",
				"白色带釉陶瓦","品红色带釉陶瓦","橙色带釉陶瓦","红色带釉陶瓦","黄色带釉陶瓦","紫色带釉陶瓦",
				"绿色带釉陶瓦","淡蓝色带釉陶瓦","黄绿色带釉陶瓦","粉红色带釉陶瓦","灰色带釉陶瓦","黑色带釉陶瓦",
				"淡灰色带釉陶瓦","棕色带釉陶瓦","蓝色带釉陶瓦","青色带釉陶瓦",
				"金矿石","钻石矿石","红石矿石","青金石矿石","萤石","骨块","花盆",
				"金矿石","钻石矿石","红石矿石","青金石矿石","萤石","骨块","花盆",
				"金矿石","钻石矿石","红石矿石","青金石矿石","萤石","骨块","花盆",
				"草径","耕地",
				"石头怪物蛋","圆石怪物蛋","石砖怪物蛋","裂石砖怪物蛋","苔石砖怪物蛋","錾制石砖怪物蛋",
				"白色羊毛","品红色羊毛","橙色羊毛","红色羊毛","黄色羊毛","紫色羊毛",
				"绿色羊毛","淡蓝色羊毛","黄绿色羊毛","粉红色羊毛","灰色羊毛","黑色羊毛",
				"淡灰色羊毛","棕色羊毛","蓝色羊毛","青色羊毛",
				"白色染色玻璃","品红色染色玻璃","橙色染色玻璃","红色染色玻璃","黄色染色玻璃","紫色染色玻璃",
				"绿色染色玻璃","淡蓝色染色玻璃","黄绿色染色玻璃","粉红色染色玻璃","灰色染色玻璃","黑色染色玻璃",
				"淡灰色染色玻璃","棕色染色玻璃","蓝色染色玻璃","青色染色玻璃",
				"火把","红石火把","末地烛","仙人掌","紫颂植物","紫颂花","可可果",
				"火把","红石火把","末地烛","仙人掌","紫颂植物","紫颂花","可可果",
				"火把","红石火把","末地烛","仙人掌","紫颂植物","紫颂花","可可果",
				"枯萎的灌木","蕨","大型蕨","蒲公英","虞美人","兰花","绒球葱","茜草花","红色郁金香",
				"橙色郁金香","白色郁金香","粉红色郁金香","滨菊","矢车菊","铃兰","凋零玫瑰","向日葵",
				"欧丁香","玫瑰丛","牡丹","睡莲","草丛","高草丛","海草","海泡菜","海带","干海带块","甘蔗",
				"海龟蛋","南瓜灯","干草块","雕刻后的南瓜","粘液块","石英块","錾制石英块","竖纹石英块",
				"煤炭块","铁块","金块","钻石块","绿宝石块","青金石块","红石块","粘液块",
				"白色混凝土粉末","品红色混凝土粉末","橙色混凝土粉末","红色混凝土粉末","黄色混凝土粉末","紫色混凝土粉末",
				"绿色混凝土粉末","淡蓝色混凝土粉末","黄绿色混凝土粉末","粉红色混凝土粉末","灰色混凝土粉末","黑色混凝土粉末",
				"淡灰色混凝土粉末","棕色混凝土粉末","蓝色混凝土粉末","青色混凝土粉末",
				"白色混凝土","品红色混凝土","橙色混凝土","红色混凝土","黄色混凝土","紫色混凝土",
				"绿色混凝土","淡蓝色混凝土","黄绿色混凝土","粉红色混凝土","灰色混凝土","黑色混凝土",
				"淡灰色混凝土","棕色混凝土","蓝色混凝土","青色混凝土",
				"橡木楼梯","丛林木楼梯","白桦木楼梯","云杉木楼梯","金合欢木楼梯","深色橡木楼梯",
				"砂岩楼梯","红砂岩楼梯","圆石楼梯","砖块楼梯","石砖楼梯","地狱砖楼梯","石英楼梯","紫珀块楼梯",
				"海晶石楼梯","海晶石砖楼梯","暗海晶石楼梯","石楼梯","安山岩楼梯","磨制安山岩楼梯",
				"闪长岩楼梯","磨制闪长岩楼梯","花岗岩楼梯","磨制花岗岩楼梯","苔石砖楼梯","裂石砖楼梯",
				"平滑砂岩楼梯","平滑红砂岩楼梯","平滑石英楼梯","末地石砖楼梯","红色地狱砖楼梯",
				"橡木台阶","丛林木台阶","白桦木台阶","云杉木台阶","金合欢木台阶","深色橡木台阶",
				"平滑石台阶","砂岩台阶","红砂岩台阶","圆石台阶","砖块台阶","石砖台阶","地狱砖台阶","石英台阶","紫珀块台阶",
				"海晶石台阶","海晶石砖台阶","暗海晶石台阶","石台阶","安山岩台阶","磨制安山岩台阶",
				"闪长岩台阶","磨制闪长岩台阶","花岗岩台阶","磨制花岗岩台阶","苔石砖台阶","裂石砖台阶",
				"平滑砂岩台阶","平滑红砂岩台阶","平滑石英台阶","末地石砖台阶","红色地狱砖台阶",
				"圆石墙","苔石墙","安山岩墙","花岗岩墙","闪长岩墙","砂岩墙","红砂岩墙","砖块墙",
				"石砖墙","苔石砖墙","地狱砖墙","红色地狱砖墙","末地石砖墙","海晶石墙",
				"铁砧","床","酿造台","工作台","附魔台","箱子","末影箱","陷阱箱","炼药锅","音符盒","熔炉",
				"白色潜影盒","品红色潜影盒","橙色潜影盒","红色潜影盒","黄色潜影盒","紫色潜影盒",
				"绿色潜影盒","淡蓝色潜影盒","黄绿色潜影盒","粉红色潜影盒","灰色潜影盒","黑色潜影盒",
				"淡灰色潜影盒","棕色潜影盒","蓝色潜影盒","青色潜影盒",
				"骷髅头颅","凋零骷髅头颅","僵尸头颅","爬行者头颅",
				"橡木告示牌","丛林木告示牌","白桦木告示牌","云杉木告示牌","金合欢木告示牌","深色橡木告示牌",
				"橡木门","丛林木门","白桦木门","云杉木门","金合欢木门","深色橡木门","铁门",
				"橡木栅栏","丛林木栅栏","白桦木栅栏","云杉木栅栏","金合欢木栅栏","深色橡木栅栏","地狱砖栅栏","铁栏杆","梯子",
				"橡木栅栏门","丛林木栅栏门","白桦木栅栏门","云杉木栅栏门","金合欢木栅栏门","深色橡木栅栏门",
				"橡木活板门","丛林木活板门","白桦木活板门","云杉木活板门","金合欢木活板门","深色橡木活板门","铁质活板门",
				"木质压力板","石质压力板","铁质测重压力板","金质测重压力板",
				"铁轨","探测铁轨","激活铁轨","动力铁轨","拌线钩","拌线","红石","拉杆","漏斗",
				"木质压力板","石质压力板","铁质测重压力板","金质测重压力板",
				"铁轨","探测铁轨","激活铁轨","动力铁轨","拌线钩","拌线","红石","拉杆","漏斗",
				"木质压力板","石质压力板","铁质测重压力板","金质测重压力板",
				"铁轨","探测铁轨","激活铁轨","动力铁轨","拌线钩","拌线","红石","拉杆","漏斗",
				"橡木按钮","丛林木按钮","白桦木按钮","云杉木按钮","金合欢木按钮","深色橡木按钮",
				"阳光传感器","发射器","投掷器","侦测器","活塞","粘性活塞","物品展示框","红石灯",
				"红石中继器","红石比较器","讲台","灯笼","织布机","制图台","制箭台","高炉","营火","钟","竹子",
				"脚手架","木桶","堆肥桶","烟熏炉","切石机","甜浆果丛","锻造台",
				"阳光传感器","发射器","投掷器","侦测器","活塞","粘性活塞","物品展示框","红石灯",
				"红石中继器","红石比较器","讲台","灯笼","织布机","制图台","制箭台","高炉","营火","钟","竹子",
				"脚手架","木桶","堆肥桶","烟熏炉","切石机","甜浆果丛","锻造台",
				"阳光传感器","发射器","投掷器","侦测器","活塞","粘性活塞","物品展示框","红石灯",
				"红石中继器","红石比较器","讲台","灯笼","织布机","制图台","制箭台","高炉","营火","钟","竹子",
				"脚手架","木桶","堆肥桶","烟熏炉","切石机","甜浆果丛","锻造台",
				"蓝冰","绿宝石矿石","书架","蜘蛛网","火","蛋糕","唱片机","TNT","龙首","附魔书",
				"钻石","龙息","绿宝石","末影水晶","烟花火箭","闪烁的西瓜片","金胡萝卜","金苹果","附魔金苹果","毒马铃薯",
				"白色染料","品红色染料","橙色染料","红色染料","黄色染料","紫色染料",
				"绿色染料","淡蓝色染料","黄绿色染料","粉红色染料","灰色染料","黑色染料",
				"淡灰色染料","棕色染料","蓝色染料","青色染料",
				"皮革帽子","皮靴","皮革外套","皮革裤子",
				"锁链头盔","锁链胸甲","锁链腿甲","锁链靴",
				"铁头盔","铁胸甲","铁腿甲","铁靴",
				"金头盔","金胸甲","金腿甲","金靴",
				"钻石头盔","钻石胸甲","钻石腿甲","钻石靴",
				"鞍","皮革马铠","铁马铠","金马铠","钻石马铠",
				"木剑","石剑","铁剑","金剑","钻石剑",
				"木斧","石斧","铁斧","金斧","钻石斧",
				"木镐","石镐","铁镐","金镐","钻石镐",
				"木锹","石锹","铁锹","金锹","钻石锹",
				"木锄","石锄","铁锄","金锄","钻石锄",
				"海龟壳","弓","弩","箭","光灵箭","火焰弹","雪球","三叉戟",
				"无效果之箭","再生之箭","迅捷之箭","抗火之箭","剧毒之箭","力量之箭",
				"虚弱之箭","夜视之箭","治疗之箭","迟缓之箭","跳跃之箭","伤害之箭","水肺之箭",
				"缓降之箭","神龟之箭","衰变之箭","隐身之箭","幸运之箭",
				"剪刀","打火石","钓鱼竿","胡萝卜钓竿","水瓶","无效果药水","无效果喷溅药水","无效果滞留药水","盾牌",
				"再生药水","迅捷药水","抗火药水","剧毒药水","力量药水",
				"虚弱药水","夜视药水","治疗药水","迟缓药水","跳跃药水","伤害药水","水肺药水",
				"缓降药水","神龟药水","衰变药水","隐身药水","幸运药水",
				"再生滞留药水","迅捷滞留药水","抗火滞留药水","剧毒滞留药水","力量滞留药水",
				"虚弱滞留药水","夜视滞留药水","治疗滞留药水","迟缓滞留药水","跳跃滞留药水","伤害滞留药水","水肺滞留药水",
				"缓降滞留药水","神龟滞留药水","衰变滞留药水","隐身滞留药水","幸运滞留药水",
				"再生喷溅药水","迅捷喷溅药水","抗火喷溅药水","剧毒喷溅药水","力量喷溅药水",
				"虚弱喷溅药水","夜视喷溅药水","治疗喷溅药水","迟缓喷溅药水","跳跃喷溅药水","伤害喷溅药水","水肺喷溅药水",
				"缓降喷溅药水","神龟喷溅药水","衰变喷溅药水","隐身喷溅药水","幸运喷溅药水","附魔之瓶",
				"时钟","空地图","林地探险家地图","海洋探险家地图","藏宝图","书与笔","成书","指南针",
				"橡木船","丛林木船","白桦木船","云杉木船","金合欢木船","深色橡木船",
				"鞘翅","矿车","TNT矿车","运输矿车","动力矿车","漏斗矿车","盔甲架",
				"白色旗帜","品红色旗帜","橙色旗帜","红色旗帜","黄色旗帜","紫色旗帜",
				"绿色旗帜","淡蓝色旗帜","黄绿色旗帜","粉红色旗帜","灰色旗帜","黑色旗帜",
				"淡灰色旗帜","棕色旗帜","蓝色旗帜","青色旗帜",
				"栓绳","命名牌","画","旗帜图案(爬行者)","旗帜图案(花朵)","旗帜图案(头颅)",
				"旗帜图案(Majong)","旗帜图案(地球)","旗帜图案(砖纹)","旗帜图案(波纹边)",
				"马","羊驼","行商羊驼","流浪商人","驴","骡","豹猫","铁傀儡","雪傀儡","劫掠兽","骷髅马","僵尸马",
				"鞘翅","矿车","TNT矿车","运输矿车","动力矿车","漏斗矿车","盔甲架",
				"马","羊驼","行商羊驼","流浪商人","驴","骡","豹猫","铁傀儡","雪傀儡","劫掠兽","骷髅马","僵尸马",
				"鞘翅","矿车","TNT矿车","运输矿车","动力矿车","漏斗矿车","盔甲架",
				"马","羊驼","行商羊驼","流浪商人","驴","骡","豹猫","铁傀儡","雪傀儡","劫掠兽","骷髅马","僵尸马",
				"鞘翅","矿车","TNT矿车","运输矿车","动力矿车","漏斗矿车","盔甲架"
				];
	var legend = ["基岩","信标","末地传送门框架","刷怪箱","下界传送门方块","末地传送门方块","潮涌核心","末地折跃门方块",
				  "龙蛋","玩家头颅","屏障","命令方块","结构方块","拼图方块","下界之星","刷怪箱矿车","命令方块矿车",
				  "调试棒","知识之书","音乐唱片(C418-13)", "音乐唱片(C418-CAT)", "音乐唱片(C418-BLOCKS)", 
				  "音乐唱片(C418-CHIRP)", "音乐唱片(C418-FAR)", "音乐唱片(C418-MALL)", "音乐唱片(C418-MELLOHI)", 
				  "音乐唱片(C418-STAL)", "音乐唱片(C418-STRAD)", "音乐唱片(C418-WARD)", "音乐唱片(C418-11)", 
				  "音乐唱片(C418-WAIT)", "爬行者刷怪蛋","牛刷怪蛋","鳕鱼刷怪蛋","鸡刷怪蛋","洞穴蜘蛛刷怪蛋","猫刷怪蛋","烈焰人刷怪蛋","蝙蝠刷怪蛋",
				  "哞菇刷怪蛋","骡刷怪蛋","海豚刷怪蛋","驴刷怪蛋","溺尸刷怪蛋","远古守卫者刷怪蛋","末影人刷怪蛋","末影螨刷怪蛋","唤魔者刷怪蛋","狐狸刷怪蛋",
				  "猪刷怪蛋","掠夺者刷怪蛋","北极熊刷怪蛋","河豚刷怪蛋","恶魂刷怪蛋","守卫者刷怪蛋","马刷怪蛋","尸壳刷怪蛋","羊驼刷怪蛋","岩浆怪刷怪蛋",
				  "骷髅马刷怪蛋","潜影贝刷怪蛋","鲑鱼刷怪蛋","兔子刷怪蛋","羊刷怪蛋","劫掠兽刷怪蛋","鹦鹉刷怪蛋","熊猫刷怪蛋","豹猫刷怪蛋","夜魅刷怪蛋",
				  "骷髅刷怪蛋","恼鬼刷怪蛋","海龟刷怪蛋","行商羊驼刷怪蛋","蜘蛛刷怪蛋","史莱姆刷怪蛋","热带鱼刷怪蛋","流浪者刷怪蛋","鱿鱼刷怪蛋",
				  "僵尸猪人刷怪蛋","僵尸村民刷怪蛋","僵尸马刷怪蛋","僵尸刷怪蛋","凋零骷髅刷怪蛋","狼刷怪蛋","女巫刷怪蛋","流浪商人刷怪蛋","村民刷怪蛋","卫道士刷怪蛋",
				  "玩家","凋灵","末影龙","杀手兔","巨人","幻术师","激活的TNT"];
	var high = Math.floor(p/10000);
	var ex = p<64;
	if(ex){
		return legend[p%legend.length];
	}
	if(h < 4){
		return normal[p%normal.length];
	}else{
		return rare[p%rare.length];
	}
}
function MD5_check(str:String):Array{
	var i = 0;
	var arr = MD5_analysis(str);
	var a1 = getID(arr[0] | arr[1] << 4 | arr[2] << 8 | arr[3] << 12);
	var a2 = getID(arr[4] | arr[5] << 4 | arr[6] << 8 | arr[7] << 12);
	while(a2 == a1){
		a2 = getID(i+(arr[4] | arr[5] << 4 | arr[6] << 8 | arr[7] << 12));
		i++;
	}
	var a3 = getID(arr[8] | arr[9] << 4 | arr[10] << 8 | arr[11] << 12);
	while(a3 == a1 || a3 == a2){
		a3 = getID(i+(arr[8] | arr[9] << 4 | arr[10] << 8 | arr[11] << 12));
		i++;
	}
	var a4 = getID(arr[12] | arr[13] << 4 | arr[14] << 8 | arr[15] << 12);
	while(a4 == a1 || a4 == a2 || a4 == a3){
		a4 = getID(i+(arr[12] | arr[13] << 4 | arr[14] << 8 | arr[15] << 12));
		i++;
	}
	var a5 = getID(arr[16] | arr[17] << 4 | arr[18] << 8 | arr[19] << 12);
	while(a5 == a1 || a5 == a2 || a5 == a3 || a5 == a4){
		a5 = getID(i+(arr[16] | arr[17] << 4 | arr[18] << 8 | arr[19] << 12));
		i++;
	}
	var d1, d2;
	d1 = arr[20] | arr[21] << 4;
	d2 = arr[22] | arr[23] << 4;
	var r1 = d1 > d2 ? d2 / d1 * 0.9 : d1 / d2 * 0.9;
	r1 = Math.floor(r1*10000)/10000;
	d1 = arr[24];
	d2 = arr[25];
	var r2 = d1 > d2 ? d2 / d1 * 0.9 * (1-r1) : d1 / d2 * 0.9 * (1-r1);
	r2 = Math.floor(r2*10000)/10000;
	d1 = arr[26];
	d2 = arr[27];
	var r3 = d1 > d2 ? d2 / d1 * 0.9 * (1-r1-r2) : d1 / d2 * 0.9 * (1-r1-r2);
	r3 = Math.floor(r3*10000)/10000;
	d1 = arr[28];
	d2 = arr[29];
	var r4 = d1 > d2 ? d2 / d1 * 0.9 * (1-r1-r2-r3) : d1 / d2 * 0.9 * (1-r1-r2-r3);
	r4 = Math.floor(r4*10000)/10000;
	var r5 = (1-r1-r2-r3-r4); 
	r5 = Math.floor(r5*10000)/10000;
	var list = [];
	trace([r1,r2,r3,r4,r5]);
	if(r1>0){
		var o = new Object();
		o.name = a1;
		o.rate = r1*100;
		list.push(o);
	}
	if(r2>0){
		var o = new Object();
		o.name = a2;
		o.rate = r2*100;
		list.push(o);
	}
	if(r3>0){
		var o = new Object();
		o.name = a3;
		o.rate = r3*100;
		list.push(o);
	}
	if(r4>0){
		var o = new Object();
		o.name = a4;
		o.rate = r4*100;
		list.push(o);
	}
	if(r5>0){
		var o = new Object();
		o.name = a5;
		o.rate = r5*100;
		list.push(o);
	}
	list.sortOn(["rate"],Array.DESCENDING |Array.NUMERIC);
	return list;
}
